



Interdomain Routing Working Group                                X. Geng
Internet-Draft                                                   M. Chen
Intended status: Standards Track                                  Huawei
Expires: April 25, 2019                                            Z. Li
                                                            China Mobile
                                                        October 22, 2018


         IGP-TE Extensions for DetNet Information Distribution
                 draft-geng-detnet-info-distribution-03

Abstract

   This document extends the IGP-TE, including OSPF-TE and ISIS-TE, to
   support DetNet by specifying new information that can be placed in
   Link State Protocol Data Units (LSP).  This information describes
   additional details regarding the state of the network that are useful
   for DetNet computations.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on April 25, 2019.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.





Geng, et al.             Expires April 25, 2019                 [Page 1]

Internet-Draft          DetNet Info Distribution            October 2018


   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4
   3.  DetNet Extensions to OSPF TE  . . . . . . . . . . . . . . . .   4
     3.1.  DetNet Node Attributes Advertisement  . . . . . . . . . .   4
       3.1.1.  Packet Processing Delay Sub-TLV . . . . . . . . . . .   4
       3.1.2.  PREOF Capability Sub-TLV  . . . . . . . . . . . . . .   5
     3.2.  DetNet Link Attributtes Advertisement . . . . . . . . . .   6
       3.2.1.  Max DetNet Reservable Bandwidth Sub-TLV . . . . . . .   7
       3.2.2.  DetNet Available Bandwidth Sub-TLV  . . . . . . . . .   7
       3.2.3.  PREOF Capability Sub-TLV  . . . . . . . . . . . . . .   8
       3.2.4.  Queuing Algorithm Capability Sub-TLV  . . . . . . . .   9
       3.2.5.  DetNet Queue Sub-TLV  . . . . . . . . . . . . . . . .  10
   4.  DetNet Extensions to ISIS TE  . . . . . . . . . . . . . . . .  12
     4.1.  DetNet Node Attributes Advertisement  . . . . . . . . . .  12
       4.1.1.  DetNet Processing Delay Sub-TLV . . . . . . . . . . .  12
       4.1.2.  PREOF Capability Sub-TLV  . . . . . . . . . . . . . .  13
     4.2.  DetNet Link Attributes Advertisement  . . . . . . . . . .  14
       4.2.1.  Max DetNet Reservable Bandwidth Sub-TLV . . . . . . .  14
       4.2.2.  DetNet Available Bandwidth Sub-TLV  . . . . . . . . .  15
       4.2.3.  PREOF Capability Sub-TLV  . . . . . . . . . . . . . .  16
       4.2.4.  Queuing Algorithm Capability Sub-TLV  . . . . . . . .  16
       4.2.5.  DetNet Queue Sub-TLV  . . . . . . . . . . . . . . . .  17
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  19
     5.1.  Sub-TLVs for OSPF Node Attribute TLV  . . . . . . . . . .  19
     5.2.  Sub-TLVs for OSPF Link TLV  . . . . . . . . . . . . . . .  19
     5.3.  Sub-TLVs for ISIS Router Capability TLV . . . . . . . . .  20
     5.4.  Sub-TLVs for  IS-IS TLVs 22, 23, 141, 222, and 223  . . .  20
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .  20
   7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  20
   8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  20
     8.1.  Normative References  . . . . . . . . . . . . . . . . . .  20
     8.2.  Informative References  . . . . . . . . . . . . . . . . .  21
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  22






Geng, et al.             Expires April 25, 2019                 [Page 2]

Internet-Draft          DetNet Info Distribution            October 2018


1.  Introduction

   There are many use cases from diverse industries which have the need
   in common for deterministic service, for example: audio video
   production, industrial process control and mobile access networks.
   The requirements can be summarized as:

      Deterministic minimum and maximum end-to-end latency from source
      to destination

      Extremely low packet loss rate

   Deterministic Networking (DetNet) can satisfy the requirements by the
   following techniques:

   o  Congestion Protection by reserving data plane resources for DetNet
      flows in intermediate nodes along the path

   o  Explicit Route that do not rapidly change with the network
      topology

   o  Seamless Redundant which can distribute DetNet flow packets over
      multi paths to ensure delivery of each packet spite of the loss of
      a path

   To make the above techniques work, it's necessary to know the
   capabilities (e.g., DetNet capable or not, which congestion
   protection algorithms are supported, etc.), resources (e.g, dedicated
   bandwidth for DetNet, buffers, etc.), performance (e.g.,
   device/queue/link delay etc.) and other relevant information of each
   DetNet capable node.  Then, a DetNet path computation element (e.g.,
   PCE or ingress of a DetNet flow) can use these information to compute
   a path that satisfies the requirement of a specific DetNet flow.
   Specifically, according to the requirements stated in DetNet
   architecture, the information should include:

   o  Bandwidth related attributes (e.g., bandwidth reserved for
      DetNet);

   o  Buffer/queue management related attributes (e.g., queue management
      algorithm, etc.);

   o  PREOF (Packet Replication, Ordering and Elimination Function)
      capabilities and parameters (e.g., maximum out-of-order packets,
      etc.);

   o  Delay related attributes (e.g., node processing delay, queuing
      delay, link delay, etc.);



Geng, et al.             Expires April 25, 2019                 [Page 3]

Internet-Draft          DetNet Info Distribution            October 2018


   This document defines extensions to OSPF and ISIS to distribute the
   above DetNet information at node and/or link granularity.

   Some of information (e.g., Link delay/loss ) can be distributed and
   collected through Traffic Engineering (TE) metric extensions
   [RFC7471] and [RFC7810], which are not covered by this document.

2.  Terminology

   All the DetNet related terminologies used in this document conform to
   the DetNet architecture [I-D.ietf-detnet-architecture].

3.  DetNet Extensions to OSPF TE

   This document defines an extension to OSPF used to advertise DetNet
   information.

3.1.  DetNet Node Attributes Advertisement

   New OSPF DetNet sub-TLVs for Node Attribute TLV[RFC5786] are defined
   to distribute the DetNet information of a node.  These sub-TLVs
   include:

         ______________________________________________________________
         |   Type |    Length     |               Value               |
         |------------------------------------------------------------|
         |  TBD1  |       8       |  DetNet Processing Delay          |
         |  TBD4  |       4       |  PREOF Capability                 |
         |________|_______________|___________________________________|

3.1.1.  Packet Processing Delay Sub-TLV

   In the scope of DetNet, packet processing delay, which begins after
   the packet goes into the input port and ends before the packet
   arrives the output buffer, can expected in a known range, and the
   value of the delay bound is specified in this sub-TLV, including:

   o  Maximum DetNet packet processing delay

   o  Minimum DetNet packet processing delay

   o  Maximum DetNet packet processing delay variation

   The format of this sub-TLV is shown in the following diagram:







Geng, et al.             Expires April 25, 2019                 [Page 4]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Type(TBD1)             |        Length(8)              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |      Minimum DetNet Processing Delay          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |      Maximum DetNet Processing Delay          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |   Maximum DetNet Processing Delay Variation   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD1.

   The Length field is 2 octets in length and its value is 8.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   The Minimum DetNet Processing Delay field is 3 octets, and presents
   the minimum delay for a DetNet flow in the device, excluding the
   queuing delay in output port.  The units are microsecond.

   The Maximum DetNet Processing Delay field is 3 octets, and presents
   the maximum delay for a DetNet flow in the device, excluding the
   queuing delay in output port.  The units are microsecond.

   The Maximum DetNet Processing Delay Variation field is 3 octets in
   length, and presents the maximum delay variation for a DetNet flow in
   the device, excluding the queuing delay in output port.  The units
   are microsecond.

3.1.2.  PREOF Capability Sub-TLV

   PREOF (Packet Replication/Elimination/Ordering Function) is for
   DetNet service protection, which includes:

   o  In-order delivery function: defined in Section 3.2.2.1 of
      [I-D.ietf-detnet-architecture]

   o  Packet replication function: defined in Section 3.2.2.2 of
      [I-D.ietf-detnet-architecture]

   o  Packet elimination function: defined in Section 3.2.2.3 of
      [I-D.ietf-detnet-architecture]

   This sub-TLV specifies a set of PREOF capabilities and relevant
   parameters at node granularity.  PREOF can also be advertised as Link



Geng, et al.             Expires April 25, 2019                 [Page 5]

Internet-Draft          DetNet Info Distribution            October 2018


   attribute (section 3.2.3), when not all of the ports in the node
   support PREOF.

   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Type(TBD4)             |         Length(4)             |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      Flags    |    Maximum out-of-order Packet Number         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD4.

   The Length field is 2 octets in length and its value is 4.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |R|E|O|         |
     +-+-+-+-+-+-+-+-+

   where:

   o  R-flag: replication-capability flag, which indicates whether a
      link has the packet replication capability.

   o  E-flag: elimination-capability flag, which indicates whether a
      link has the packet elimination capability

   o  O-flag: in-order-capability, which indicates whether a LTP has the
      in-order delivery capability

   Maximum out-of-order Packet Number field is 3 octet in length, and
   presents the maximum number of out-of-order packets that this link
   can support, it depends on the reserved buffer size for packet
   reordering.  This value is valid only when the O-flag is set.

3.2.  DetNet Link Attributtes Advertisement

   New OSPF DetNet sub-TLVs for Link TLV are defined to distribute
   DetNet information of a link.  These sub-TLVs include:







Geng, et al.             Expires April 25, 2019                 [Page 6]

Internet-Draft          DetNet Info Distribution            October 2018


         ______________________________________________________________
         |   Type |    Length     |               Value               |
         |------------------------------------------------------------|
         |  TBD2  |       4       |  Max DetNet Reservable Bandwidth  |
         |  TBD3  |       4       |  DetNet Available Bandwidth       |
         |  TBD4  |       4       |  PREOF Capability                 |
         |  TBD5  |       4       |  Queuing Algorithm Capabilities   |
         |  TBD6  |       10      |  Queue Parameters                 |
         |________|_______________|___________________________________|

3.2.1.  Max DetNet Reservable Bandwidth Sub-TLV

   This sub-TLV specifies the maximum amount of bandwidth that is
   reserved for DetNet on this link.  Note that this value SHOULD be
   smaller than the value of Maximum Reservable Bandwidth sub-TLV
   [RFC3630].  The value normally depends on the queuing management
   algorithm and is user-configurable.  In some particular queuing
   management algorithm (e.g.  Credit Based shaper in AVB), this value
   will affect the calculation of maximum queuing delay of the DetNet
   flow.  The units are bytes per second.

   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |            Type(TBD2)         |           Length(4)           |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |      Maximum DetNet Reservable Bandwidth      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD2.

   The Length field is 2 octets in length and its value is 4.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   This Maximum DetNet Reservable Bandwidth field is 3 octets in length,
   and presents the maximum bandwidth that may be reserved for DetNet.
   The units are bytes per second.

3.2.2.  DetNet Available Bandwidth Sub-TLV

   This sub-TLV specifies the available bandwidth that can be reserved
   for DetNet flow on this link for now.  Considering that there is no
   generally accepted DetNet traffic classification, this value contains
   all the available DetNet Bandwidth from different DetNet traffic



Geng, et al.             Expires April 25, 2019                 [Page 7]

Internet-Draft          DetNet Info Distribution            October 2018


   classes (if there is any), which differs from the Unreserved
   Bandwidth defined in [RFC3630].

   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Type(TBD3)             |       Length(4)               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |          Available DetNet Bandwidth           |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD3.

   The Length field is 2 octets in length and its value is 4.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   This Available DetNet Bandwidth field is 3 octets in length, and
   presents the available bandwidth for DetNet in this link.  The units
   are bytes per second.

3.2.3.  PREOF Capability Sub-TLV

   PREOF (Packet Replication/Elimination/Ordering Function) is for
   DetNet service protection, which includes :

   o  In-order delivery function: defined in Section 3.2.2.1 of
      [I-D.ietf-detnet-architecture]

   o  Packet replication function: defined in Section 3.2.2.2 of
      [I-D.ietf-detnet-architecture]

   o  Packet elimination function: defined in Section 3.2.2.3 of
      [I-D.ietf-detnet-architecture]

   This sub-TLV specifies a set of PREOF capabilities and relevant
   parameters at link granularity.  PREOF can also be advertised as node
   attribute (section 3.1.2), when all of the ports in the node support
   PREOF.

   The format of this sub-TLV is shown in the following diagram:







Geng, et al.             Expires April 25, 2019                 [Page 8]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Type(TBD4)             |         Length(4)             |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      Flags    |    Maximum out-of-order Packet Number         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD4.

   The Length field is 2 octets in length and its value is 4.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |R|E|O|         |
     +-+-+-+-+-+-+-+-+

   where:

   o  R-flag: replication-capability flag, which indicates whether a
      link has the packet replication capability.

   o  E-flag: elimination-capability flag, which indicates whether a
      link has the packet elimination capability

   o  O-flag: in-order-capability, which indicates whether a LTP has the
      in-order delivery capability

   Maximum out-of-order Packet Number field is 3 octet in length, and
   presents the maximum number of out-of-order packets that this link
   can support, it depends on the reserved buffer size for packet
   reordering.  This value is valid only when the O-flag is set.

3.2.4.  Queuing Algorithm Capability Sub-TLV

   This sub-TLV specifies queuing management algorithms capabilities to
   gaurante bounded queuing latency [I-D.finn-detnet-bounded-latency].

   The format of this sub-TLV is shown in the following diagram:










Geng, et al.             Expires April 25, 2019                 [Page 9]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Type(TBD5)             |        Length(4)              |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      Flags    |                RESERVED                       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD5.

   The Length field is 2 octets in length and its value is 4.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |C|T|H|A|       |
     +-+-+-+-+-+-+-+-+

   where:

   o  C-flag: CBS flag, which indicates whether a link can support Time
      Aware Shaping [IIEEE802.1Qbv].

   o  T-flag: TAS flag, which indicuate whether a link can support
      Credit Based Shaper [IEEE802.1Q-2014]

   o  H-flag: CQF flag, which indicuate whether a link can support
      Cyclic Queuing and Forwarding [IEEE802.1Qch]

   o  A-flag: ATS flag, which indicuate whether a link can support
      Asynchronous Traffic Shaping [IEEE802.1Qcr]

3.2.5.  DetNet Queue Sub-TLV

   In the context of DetNet, the delay of queuing is bounded, and the
   bound depends on what queuing management method is used and how many
   buffers are allocated.  This sub-TLV specifies the DetNet queue
   parameters.

   The format of this sub-TLV is shown in the following diagram:







Geng, et al.             Expires April 25, 2019                [Page 10]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |        Type(TBD6)             |          Length(10)           |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       Queue Identifier        |       Queue Buffer Size       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Flags    |            Maximum Queuing Delay               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED   |            Minimum Queuing Delay               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED   |        Maximum Queuing Delay Variation         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 2 octets in length, and the value is TBD6.

   The Length field is 2 octets in length and its value is 10.

   The Queue Identifier field is 3 octets in length, and specifies the
   identifier of a queue.  It could be an internal identifier that is
   only used within a node.  Or it could be used by a centralized
   controller to specify in which specific queue a flow/packet is
   required to enter.

   The Queue Buffer Size field is 3 octets in length, and specifies the
   size of a queue with unit of bytes.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |C|T|H|A|       |
     +-+-+-+-+-+-+-+-+

   where:

   o  C-flag: CBS flag, which indicates whether a link can support Time
      Aware Shaping [IIEEE802.1Qbv].

   o  T-flag: TAS flag, which indicuate whether a link can support
      Credit Based Shaper [IEEE802.1Q-2014]

   o  H-flag: CQF flag, which indicuate whether a link can support
      Cyclic Queuing and Forwarding [IEEE802.1Qch]

   o  A-flag: ATS flag, which indicuate whether a link can support
      Asynchronous Traffic Shaping [IEEE802.1Qcr]




Geng, et al.             Expires April 25, 2019                [Page 11]

Internet-Draft          DetNet Info Distribution            October 2018


   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   Minimum Queuing Delay is 3 octets in length, and carries minimum
   queuing delay value (in microseconds) encoded as an integer value.
   Implementations may also add this to the value of Min Delay
   Unidirectional Link Delay Sub-TLV [RFC7471] in order to advertise the
   minimum delay of this link.  Min Queuing Delay can be the same with
   the Max Queuing Delay.

   Maximum Queuing Delay is 3 octets in length, and carries the maximum
   queuing delay value (in microseconds) encoded as an integer value.
   Implementations may also add this to the value of Max Delay
   Unidirectional Link Delay Sub-TLV [RFC7471]to order to advertise the
   maximum delay of this link.

   Maximum Queuing Delay variation is 3 octets in length, and carries
   the maximum queuing delay variation value (in microseconds) encoded
   as an integer value.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

4.  DetNet Extensions to ISIS TE

   This document defines an extension to IS-IS used to advertise DetNet
   information.

4.1.  DetNet Node Attributes Advertisement

   The DetNet node sub-TLVs are defined within the body of the IS-IS
   Router Capability TLV [RFC7981] to carry DetNet information.

4.1.1.  DetNet Processing Delay Sub-TLV

   This sub-TLV specifies the DetNet packet porcessing parameters.  The
   reader can know more about this sub-TLV referring to section 3.1.

   The format of this sub-TLV is shown in the following diagram:












Geng, et al.             Expires April 25, 2019                [Page 12]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type(TBD7)  |   Length(8)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |      Minimum DetNet Processing Delay          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |      Maximum DetNet Processing Delay          |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |   Maximum DetNet Processing Delay Variation   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 1 octets in length, and the value is TBD7.

   The Length field is 1 octets in length and its value is 8.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   The Minimum DetNet Processing Delay is 3 octets in length and
   presents the minimum delay for a DetNet flow in the device, excluding
   the queuing delay in output port.  The units are microsecond.

   The Maximum DetNet Processing Delay is 3 octets in length and
   presents the maximum delay for a DetNet flow in the device, excluding
   the queuing delay in output port.  The units are microsecond.

   The Maximum DetNet Processing Delay Variation is 3 octets in length
   and presents the maximum delay variation for a DetNet flow in the
   device, excluding the queuing delay in output port.  The units are
   microsecond.

4.1.2.  PREOF Capability Sub-TLV

   This sub-TLV specifies a set of PREOF capabilities and relevant
   parameters in sub-TLV.  The reader can know more about this sub-TLV
   referring to section 3.4.

   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type(TBD10) |   Length(4)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      Flags    |    Maximum out-of-order Packet Number         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




Geng, et al.             Expires April 25, 2019                [Page 13]

Internet-Draft          DetNet Info Distribution            October 2018


   The Type field is 1 octets in length, and the value is TBD10.

   The Length field is 1 octets in length and its value is 4.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |R|E|O|         |
     +-+-+-+-+-+-+-+-+

   where:

   o  R-flag: replication-capability flag, which indicates whether a
      link has the packet replication capability.

   o  E-flag: elimination-capability flag, which indicates whether a
      link has the packet elimination capability

   o  O-flag: in-order-capability, which indicates whether a LTP has the
      in-order delivery capability

   Maximum out-of-order Packet Number field is 3 octets in length and
   presents the maximum number of out-of-order packets that this link
   can support, it depends on the reserved buffer size for packet
   reordering.  This value is valid only when the O-flag is set.

4.2.  DetNet Link Attributes Advertisement

   This document defines new IS-IS TE sub-TLVs that can be announced in
   the TLVs 22, 23, 141, 222, and 223 in order to distribute DetNet
   information.  The sub-TLV extensions below build on the ones provided
   in [RFC5305], [RFC5316]and [RFC7310]

4.2.1.  Max DetNet Reservable Bandwidth Sub-TLV

   This sub-TLV specifies the maximum amount of bandwidth that is
   reserved for DetNet on this link.  Note that this value SHOULD be
   smaller than the value of Maximum Reservable Link Bandwidth
   [RFC5305].  The reader can know more about this sub-TLV referring to
   section 3.2.

   The format of this sub-TLV is shown in the following diagram:








Geng, et al.             Expires April 25, 2019                [Page 14]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type(TBD8)  |   Length(4)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |      Maximum DetNet Reservable Bandwidth      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 1 octets in length, and the value is TBD8.

   The Length field is 1 octets in length and its value is 4.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   This Maximum DetNet Reservable Bandwidth field is 3 octets in length
   and presents the maximum bandwidth that may be reserved for DetNet.
   The units are bytes per second.

4.2.2.  DetNet Available Bandwidth Sub-TLV

   This sub-TLV specifies the available bandwidth that can be reserved
   for DetNet flow on this link for now.  It is different from the
   Unreserved Bandwidth sub-TLV defined in [RFC5305] referring to
   section 3.3.

   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type(TBD9)  |   Length(4)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED    |          Available DetNet Bandwidth           |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 1 octets in length, and the value is TBD9.

   The Length field is 1 octets in length and its value is 4.

   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   This Available DetNet Bandwidth field is 3 octets in length and
   presents the available bandwidth for DetNet in this link.  The units
   are bytes per second.





Geng, et al.             Expires April 25, 2019                [Page 15]

Internet-Draft          DetNet Info Distribution            October 2018


4.2.3.  PREOF Capability Sub-TLV

   This sub-TLV specifies a set of PREOF capabilities and relevant
   parameters in sub-TLV.  The reader can know more about this sub-TLV
   referring to section 3.4.

   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type(TBD10) |   Length(4)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      Flags    |    Maximum out-of-order Packet Number         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 1 octets in length, and the value is TBD10.

   The Length field is 1 octets in length and its value is 4.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |R|E|O|         |
     +-+-+-+-+-+-+-+-+

   where:

   o  R-flag: replication-capability flag, which indicates whether a
      link has the packet replication capability.

   o  E-flag: elimination-capability flag, which indicates whether a
      link has the packet elimination capability

   o  O-flag: in-order-capability, which indicates whether a LTP has the
      in-order delivery capability

   Maximum out-of-order Packet Number field is 3 octets in length and
   presents the maximum number of out-of-order packets that this link
   can support, it depends on the reserved buffer size for packet
   reordering.  This value is valid only when the O-flag is set.

4.2.4.  Queuing Algorithm Capability Sub-TLV

   This sub-TLV specifies queuing management algorithms capabilities to
   gaurante bounded queuing latency [I-D.finn-detnet-bounded-latency].




Geng, et al.             Expires April 25, 2019                [Page 16]

Internet-Draft          DetNet Info Distribution            October 2018


   The format of this sub-TLV is shown in the following diagram:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |  Type(TBD11)  |   Length(4)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |      Flags    |                RESERVED                       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 1 octets in length, and the value is TBD11.

   The Length field is 1 octets in length and its value is 4.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |C|T|H|A|       |
     +-+-+-+-+-+-+-+-+

   where:

   o  C-flag: CBS flag, which indicates whether a link can support Time
      Aware Shaping [IIEEE802.1Qbv].

   o  T-flag: TAS flag, which indicuate whether a link can support
      Credit Based Shaper [IEEE802.1Q-2014]

   o  H-flag: CQF flag, which indicuate whether a link can support
      Cyclic Queuing and Forwarding [IEEE802.1Qch]

   o  A-flag: ATS flag, which indicuate whether a link can support
      Asynchronous Traffic Shaping [IEEE802.1Qcr]

4.2.5.  DetNet Queue Sub-TLV

   In the context of DetNet, the delay of queuing is bounded, and the
   bound depends on what queuing management method is used and how many
   buffers are allocated.  This sub-TLV specifies the DetNet queue
   parameters.

   The format of this sub-TLV is shown in the following diagram:








Geng, et al.             Expires April 25, 2019                [Page 17]

Internet-Draft          DetNet Info Distribution            October 2018


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |  Type(TBD12)  |  Length(10)   |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |       Queue Identifier        |       Queue Buffer Size       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Flags    |            Maximum Queuing Delay               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED   |            Minimum Queuing Delay               |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   RESERVED   |        Maximum Queuing Delay Variation         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

   The Type field is 1 octets in length, and the value is TBD12.

   The Length field is 1 octets in length and its value is 10.

   The Queue Identifier field specifies the identifier of a queue.  It
   could be an internal identifier that is only used within a node.  Or
   it could be used by a centralized controller to specify in which
   specific queue a flow/packet is required to enter.

   The Queue Buffer Size field specifies the size of a queue with unit
   of bytes.

   The Flags field is 1 octet in length, and it is designed as follows:

     0 1 2 3 4 5 6 7 8
     +-+-+-+-+-+-+-+-+
     |C|T|H|A|       |
     +-+-+-+-+-+-+-+-+

   where:

   o  C-flag: CBS flag, which indicates whether a link can support Time
      Aware Shaping [IIEEE802.1Qbv].

   o  T-flag: TAS flag, which indicuate whether a link can support
      Credit Based Shaper [IEEE802.1Q-2014]

   o  H-flag: CQF flag, which indicuate whether a link can support
      Cyclic Queuing and Forwarding [IEEE802.1Qch]

   o  A-flag: ATS flag, which indicuate whether a link can support
      Asynchronous Traffic Shaping [IEEE802.1Qcr]





Geng, et al.             Expires April 25, 2019                [Page 18]

Internet-Draft          DetNet Info Distribution            October 2018


   The RESERVED field is reserved for future use.  It MUST be set to 0
   when sent and MUST be ignored when received.

   Minimum Queuing Delay is 3 octets in length and presents minimum
   queuing delay value (in microseconds) encoded as an integer value.
   Implementations may also add this to the value of Min Delay
   Unidirectional Link Delay Sub-TLV [RFC7471] in order to advertise the
   minimum delay of this link.  Min Queuing Delay can be the same with
   the Max Queuing Delay.

   Maximum Queuing Delay is 3 octets in length and presents the maximum
   queuing delay value (in microseconds) encoded as an integer value.
   Implementations may also add this to the value of Max Delay
   Unidirectional Link Delay Sub-TLV [RFC7471]to order to advertise the
   maximum delay of this link.

   Maximum Queuing Delay variation is 3 octets in length and presents
   the maximum queuing delay variation value (in microseconds) encoded
   as an integer value.

5.  IANA Considerations

5.1.  Sub-TLVs for OSPF Node Attribute TLV

   IANA is requested to register the OSPF sub-TLVs defined in this
   document in the sub-TLVs for Node Attribute TLV registry.

         Type        Description
         ----        ------------------------------
         TBD1        Packet Processing Delay
         TBD2        PREOF Capability

5.2.  Sub-TLVs for OSPF Link TLV

   IANA is requested to register the OSPF sub-TLVs defined in this
   document in the sub-TLVs for Link TLV registry.

         Type        Description
         ----        ------------------------------
         TBD3        Maximum DetNet Reservable Bandwidth
         TBD4        DetNet Available Bandwidth
         TBD5        PREOF Capability
         TBD6        Queuing Algorithm Capabilities
         TBD7        Queue Parameters







Geng, et al.             Expires April 25, 2019                [Page 19]

Internet-Draft          DetNet Info Distribution            October 2018


5.3.  Sub-TLVs for ISIS Router Capability TLV

   IANA is requested to register the ISIS sub-TLVs defined in this
   document in the sub-TLVs for Router Capability TLV registry.

         Type        Description
         ----        ------------------------------
         TBD8        Packet Processing Delay
         TBD9        PREOF Capability

5.4.  Sub-TLVs for IS-IS TLVs 22, 23, 141, 222, and 223

   IANA is requested to register the ISIS sub-TLVs defined in this
   document in the Sub-TLVs for TLVs 22, 23, 141, 222, and 223 registry.

         Type        Description
         ----        ------------------------------
         TBD10       Maximum DetNet Reservable Bandwidth
         TBD11       DetNet Available Bandwidth
         TBD12       PREOF Capability
         TBD13       Queuing Algorithm Capabilities
         TBD14       Queue Parameters

6.  Security Considerations

   This document does not introduce security issues beyond those
   discussed in [RFC7471] and [RFC7810].

7.  Acknowledgements

8.  References

8.1.  Normative References

   [I-D.finn-detnet-bounded-latency]
              Finn, N., Boudec, J., Mohammadpour, E., Varga, B., and J.
              Farkas, "DetNet Bounded Latency", draft-finn-detnet-
              bounded-latency-01 (work in progress), July 2018.

   [I-D.ietf-detnet-architecture]
              Finn, N., Thubert, P., Varga, B., and J. Farkas,
              "Deterministic Networking Architecture", draft-ietf-
              detnet-architecture-08 (work in progress), September 2018.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.



Geng, et al.             Expires April 25, 2019                [Page 20]

Internet-Draft          DetNet Info Distribution            October 2018


   [RFC5786]  Aggarwal, R. and K. Kompella, "Advertising a Router's
              Local Addresses in OSPF Traffic Engineering (TE)
              Extensions", RFC 5786, DOI 10.17487/RFC5786, March 2010,
              <https://www.rfc-editor.org/info/rfc5786>.

   [RFC7471]  Giacalone, S., Ward, D., Drake, J., Atlas, A., and S.
              Previdi, "OSPF Traffic Engineering (TE) Metric
              Extensions", RFC 7471, DOI 10.17487/RFC7471, March 2015,
              <https://www.rfc-editor.org/info/rfc7471>.

   [RFC7810]  Previdi, S., Ed., Giacalone, S., Ward, D., Drake, J., and
              Q. Wu, "IS-IS Traffic Engineering (TE) Metric Extensions",
              RFC 7810, DOI 10.17487/RFC7810, May 2016,
              <https://www.rfc-editor.org/info/rfc7810>.

   [RFC7981]  Ginsberg, L., Previdi, S., and M. Chen, "IS-IS Extensions
              for Advertising Router Information", RFC 7981,
              DOI 10.17487/RFC7981, October 2016,
              <https://www.rfc-editor.org/info/rfc7981>.

8.2.  Informative References

   [IEEE802.1Q-2014]
              "MAC Bridges and VLANs (IEEE 802.1Q-2014)", 2014.

   [IEEE802.1Qch]
              "Cyclic Queuing and Forwarding", 2016.

   [IEEE802.1Qcr]
              "Asynchronous Traffic Shaping", 2016.

   [IIEEE802.1Qbv]
              "Enhancements for Scheduled Traffic", 2016.

   [RFC3630]  Katz, D., Kompella, K., and D. Yeung, "Traffic Engineering
              (TE) Extensions to OSPF Version 2", RFC 3630,
              DOI 10.17487/RFC3630, September 2003,
              <https://www.rfc-editor.org/info/rfc3630>.

   [RFC5305]  Li, T. and H. Smit, "IS-IS Extensions for Traffic
              Engineering", RFC 5305, DOI 10.17487/RFC5305, October
              2008, <https://www.rfc-editor.org/info/rfc5305>.

   [RFC5316]  Chen, M., Zhang, R., and X. Duan, "ISIS Extensions in
              Support of Inter-Autonomous System (AS) MPLS and GMPLS
              Traffic Engineering", RFC 5316, DOI 10.17487/RFC5316,
              December 2008, <https://www.rfc-editor.org/info/rfc5316>.




Geng, et al.             Expires April 25, 2019                [Page 21]

Internet-Draft          DetNet Info Distribution            October 2018


   [RFC7310]  Lindsay, J. and H. Foerster, "RTP Payload Format for
              Standard apt-X and Enhanced apt-X Codecs", RFC 7310,
              DOI 10.17487/RFC7310, July 2014,
              <https://www.rfc-editor.org/info/rfc7310>.

Authors' Addresses

   Xuesong Geng
   Huawei

   Email: gengxuesong@huawei.com


   Mach(Guoyi) Chen
   Huawei

   Email: mach.chen@huawei.com


   Zhenqiang
   China Mobile

   Email: lizhenqiang@chinamobile.com




























Geng, et al.             Expires April 25, 2019                [Page 22]
